<template>
	<section class="faq">
		<div class="container px-3">
			<h4 class="title">Часто задаваемые вопросы</h4>
			<div class="divide-y-2 select-none">
				<div v-for="question in faqs" class="py-8">
					<div class="flex items-center justify-between gap-5">
						<span class="text-2xl sm:text-3xl">{{ question.question }}</span>
						<span @click="toggleFaq(question.id)"
							class="flex justify-center items-center shrink-0 w-[40px] h-[40px] sm:w-[50px] sm:h-[50px] transition-all border rounded-full border-secondary-500 cursor-pointer"
							:class="{ 'rotate-180': activeFaq.includes(question.id) }">
							<ChevronDownIcon class="w-5 sm:w-6" />
						</span>
					</div>
					<div class="h-0 transition-all overflow-hidden "
						:class="{ 'h-auto pt-5 sm:pt-7': activeFaq.includes(question.id) }">
						<p class="text-lg sm:text-xl">
							{{ question.answer }}
						</p>
					</div>
				</div>
			</div>

		</div>
	</section>
</template>

<script setup lang="ts">
import { ChevronDownIcon } from '@heroicons/vue/24/solid';

const activeFaq = ref<string[]>([])
const toggleFaq = (id: string) => {
	const exist = activeFaq.value.find(q => q == id)
	if (!exist) {
		activeFaq.value.push(id)
	} else {
		activeFaq.value = activeFaq.value.filter(q => q !== id)
	}
}
const faqs = ref([
	{
		id: 'question-1',
		question: 'Правила покупки недвижимости иностранцами',
		answer: 'Правила покупки недвижимости иностранцами зависят от страны. Обычно существуют требования и ограничения. Во многих странах иностранцы могут приобретать недвижимость только с разрешения местных властей или по специальной лицензии. Ограничения могут касаться типа недвижимости: например, иностранцы могут иметь право на покупку только жилых объектов, а не коммерческих или земельных. Также иностранцы должны иметь определенный юридический статус, как, например, резиденты или инвесторы. Часто требуется подтверждение финансовой состоятельности и источников доходов, а также могут быть дополнительные налоги или сборы при покупке. Процесс покупки может включать юридические и административные шаги, такие как нотариальное оформление и регистрация права собственности. В некоторых странах существуют ограничения по регионам или зонам, где иностранцы могут приобретать недвижимость. Для точной информации лучше обратиться к местным юридическим специалистам или агентствам недвижимости'
	},
	{
		id: "question-2",
		question: 'Минимальная сумма инвестиций',
		answer: 'Правила покупки недвижимости иностранцами зависят от страны. Обычно существуют требования и ограничения. Во многих странах иностранцы могут приобретать недвижимость только с разрешения местных властей или по специальной лицензии. Ограничения могут касаться типа недвижимости: например, иностранцы могут иметь право на покупку только жилых объектов, а не коммерческих или земельных. Также иностранцы должны иметь определенный юридический статус, как, например, резиденты или инвесторы. Часто требуется подтверждение финансовой состоятельности и источников доходов, а также могут быть дополнительные налоги или сборы при покупке. Процесс покупки может включать юридические и административные шаги, такие как нотариальное оформление и регистрация права собственности. В некоторых странах существуют ограничения по регионам или зонам, где иностранцы могут приобретать недвижимость. Для точной информации лучше обратиться к местным юридическим специалистам или агентствам недвижимости'
	},
	{
		id: 'question-3',
		question: 'Процедура оформления сделки',
		answer: 'Правила покупки недвижимости иностранцами зависят от страны. Обычно существуют требования и ограничения. Во многих странах иностранцы могут приобретать недвижимость только с разрешения местных властей или по специальной лицензии. Ограничения могут касаться типа недвижимости: например, иностранцы могут иметь право на покупку только жилых объектов, а не коммерческих или земельных. Также иностранцы должны иметь определенный юридический статус, как, например, резиденты или инвесторы. Часто требуется подтверждение финансовой состоятельности и источников доходов, а также могут быть дополнительные налоги или сборы при покупке. Процесс покупки может включать юридические и административные шаги, такие как нотариальное оформление и регистрация права собственности. В некоторых странах существуют ограничения по регионам или зонам, где иностранцы могут приобретать недвижимость. Для точной информации лучше обратиться к местным юридическим специалистам или агентствам недвижимости'
	},
	{
		id: "question-4",
		question: 'Стоимость обслуживания и коммунальные платежи',
		answer: 'Правила покупки недвижимости иностранцами зависят от страны. Обычно существуют требования и ограничения. Во многих странах иностранцы могут приобретать недвижимость только с разрешения местных властей или по специальной лицензии. Ограничения могут касаться типа недвижимости: например, иностранцы могут иметь право на покупку только жилых объектов, а не коммерческих или земельных. Также иностранцы должны иметь определенный юридический статус, как, например, резиденты или инвесторы. Часто требуется подтверждение финансовой состоятельности и источников доходов, а также могут быть дополнительные налоги или сборы при покупке. Процесс покупки может включать юридические и административные шаги, такие как нотариальное оформление и регистрация права собственности. В некоторых странах существуют ограничения по регионам или зонам, где иностранцы могут приобретать недвижимость. Для точной информации лучше обратиться к местным юридическим специалистам или агентствам недвижимости'
	}
])
</script>

<style scoped></style>